[
  {
    "slug": "about",
    "title": "About Us",
    "html": "<h2>About Miftah Som Academy</h2>\n<p>Miftah Som Academy is a comprehensive digital platform dedicated to empowering families with knowledge and resources in health, parenting, education, and Islamic values. We serve as a trusted source of evidence-based information, combining modern research with cultural wisdom to support families in their journey toward holistic well-being.</p>\n<p>Founded with the vision of creating accessible, high-quality educational content, Miftah Som Academy brings together experts, educators, and content creators committed to making a positive impact in the lives of families worldwide.</p>\n<hr>\n<h2>Our Mission</h2>\n<p>Our mission is to provide families with reliable, evidence-based information and resources that support their physical, mental, and spiritual growth. We are committed to:</p>\n<ul>\n<li><p><strong>Empowering Families</strong>: Offering practical, actionable guidance that families can apply in their daily lives to promote health, education, and well-being.</p>\n</li>\n<li><p><strong>Promoting Education</strong>: Creating accessible educational content that helps parents make informed decisions about their children&#39;s development, learning, and upbringing.</p>\n</li>\n<li><p><strong>Preserving Cultural Heritage</strong>: Celebrating and sharing valuable cultural and Islamic traditions while adapting them to modern contexts.</p>\n</li>\n<li><p><strong>Building Community</strong>: Fostering a supportive community where families can share experiences, learn from one another, and grow together.</p>\n</li>\n<li><p><strong>Ensuring Quality</strong>: Maintaining the highest standards of accuracy, reliability, and professionalism in all our content and resources.</p>\n</li>\n</ul>\n<p>Through our commitment to excellence and our dedication to serving families, we strive to be a beacon of knowledge and support for parents, caregivers, and educators everywhere.</p>\n",
    "language": "en"
  },
  {
    "slug": "about",
    "title": "Ku Saabsan",
    "html": "<h2>Ku Saabsan Miftah Som Academy</h2>\n<p>Miftah Som Academy waa platform digital ah oo dhamaystiran oo loogu talagalay in la siiyo qoysaska aqoon iyo khayraadka ku saabsan caafimaadka, barbaarinta, waxbarashada, iyo qiyamka Islaamka. Waxaan nahay ilaha lagu kalsoonaan karo ee macluumaadka ku salaysan xogta, iyadoo la isku darayo cilmi-baadhista casriga ah iyo xigmadda dhaqanka si loogu taageero qoysaska jahwareerka noolaha ee wadajirka ah.</p>\n<p>Waxaa la aasaasay iyadoo la eegayo arinta in la sameeyo macluumaad waxbarasho oo gaar ah, tayo sare leh, Miftah Som Academy waxay soo wadaagtaa khubaro, macallimiin, iyo qorayaal macluumaad oo u go&#39;an inay sameeyaan saamayn wanaagsan nolosha qoysaska dunida ku nool.</p>\n<hr>\n<h2>Ujeeddadeena</h2>\n<p>Ujeeddadeena waa inaan siinayno qoysaska macluumaad aamin ah, ku salaysan xogta, iyo khayraadka oo taageeraya koritaankooda jidheedka, maskaxeedka, iyo ruuxiga ah. Waxaan u go&#39;anahay:</p>\n<ul>\n<li><p><strong>Siinta Awood Qoysaska</strong>: Bixinta hagitaan dhaqanle, la waadixi karo oo qoysaska ku adeegsan karaan noloshooda maalinle si ay u horumariyaan caafimaadka, waxbarashada, iyo wanaaga.</p>\n</li>\n<li><p><strong>Kor u Qaadista Waxbarashada</strong>: Abuurista macluumaad waxbarasho oo la gaadhi karo oo ka caawiya waalidka go&#39;aamada xog ogaal ah ee ku saabsan horumarka, barashada, iyo barbaarinta carruurtooda.</p>\n</li>\n<li><p><strong>Ilaalinta Dhaqanka</strong>: Dabaaldeg iyo wadaagista caadooyin iyo Islaami dhaqan ahaan oo muhiim ah iyadoo la isku darayo qaar casriga ah.</p>\n</li>\n<li><p><strong>Dhiska Bulshada</strong>: Abuurista bulsho taageereysa halka qoysaska ay wadaagaan khibrado, ay wax u bartaan, oo ay wada koraan.</p>\n</li>\n<li><p><strong>Hubinta Tayada</strong>: Ilaalinta heerka ugu sareeya ee sax ah, la aamin karo, iyo professional ahaansha dhammaan macluumaadkeenna iyo khayraadkeenna.</p>\n</li>\n</ul>\n<p>Iyadoo aan ku tirsannahay hufnaanta iyo u go&#39;anta aan u adeegno qoysaska, waxaan u dadaalaynaa inaan noqonno iftiinka aqoonta iyo taageerada waalidka, daryeelaaya, iyo macallimiinta meel kasta.</p>\n",
    "language": "so"
  },
  {
    "slug": "archive",
    "title": "Article Archive",
    "html": "<h2>Article Archive</h2>\n<p>Welcome to the Miftah Som Academy Article Archive. Here you can explore our comprehensive collection of articles covering a wide range of topics designed to support and empower families.</p>\n<h3>Browse by Category</h3>\n<p><strong>Health &amp; Nutrition</strong>: Discover articles on child health, nutrition, wellness, and natural approaches to building strong immune systems and maintaining family well-being.</p>\n<p><strong>Parenting</strong>: Access practical parenting advice, tips for new parents, strategies for raising confident children, and guidance on navigating the challenges and joys of parenthood.</p>\n<p><strong>Education</strong>: Explore content on early childhood education, STEM learning, educational strategies, and methods to support your child&#39;s academic and personal growth.</p>\n<p><strong>Baby Names</strong>: Find meaningful name suggestions, learn about name meanings, and discover traditional and modern naming options for your child.</p>\n<p><strong>Quran Studies</strong>: Access resources on Quran memorization, Islamic education for children, spiritual development, and methods for teaching Islamic values.</p>\n<h3>Featured Collections</h3>\n<ul>\n<li>Essential guides for new parents</li>\n<li>Seasonal health and wellness tips</li>\n<li>Educational activities and learning resources</li>\n<li>Cultural and Islamic naming traditions</li>\n<li>Family wellness strategies</li>\n</ul>\n<h3>Search and Filter</h3>\n<p>Use our search functionality to find articles on specific topics, or browse by category, date, or popularity. Our archive is continuously updated with new content to keep you informed and supported in your family journey.</p>\n<h3>Stay Updated</h3>\n<p>Subscribe to our newsletter or follow us on social media to receive notifications when new articles are added to our archive.</p>\n<p>Thank you for being part of the Miftah Som Academy community. We&#39;re here to support you every step of the way.</p>\n",
    "language": "en"
  },
  {
    "slug": "archive",
    "title": "Kaydka Maqaallada",
    "html": "<h2>Kaydka Maqaallada</h2>\n<p>Ku soo dhawoow Kaydka Maqaallada Miftah Som Academy. Halkan waxaad baadi kartaa kaydkeena oo dhamaystiran oo maqaallo ah oo qabaya mawduucyo kala duwan oo loogu talagalay in lagu taageero laguuna siiyo awood qoysaska.</p>\n<h3>Raadinta Qaybaha</h3>\n<p><strong>Caafimaadka iyo Nafkaafa</strong>: Baadi maqaallo ku saabsan caafimaadka carruurta, nafkaafa, wanaaga, iyo hababka dabiiciga ah ee dhiska nidaamka difaaca xoogga ah iyo ilaalinta wanaaga qoyska.</p>\n<p><strong>Barbaarinta</strong>: Hel caawinta barbaarinta dhaqanle, talooyin waalidka cusub, istiraatiijiyooyinka kor u qaadista carruurta isku kalsoon, iyo hagitaan ku saabsan ku dhex dhaca iyo farxada barbaarinta.</p>\n<p><strong>Waxbarashada</strong>: Baadi macluumaad ku saabsan waxbarashada carruurta yar, barashada STEM, istiraatiijiyooyinka waxbarashada, iyo hababka taageerida koritaanka akadeemiga iyo shakhsiga ah ee carruurtaada.</p>\n<p><strong>Magacyada Carruurta</strong>: Hel talooyin magac macno leh, baro macnaha magacyada, oo baadi doorashooyin dhaqanka ah iyo casriga ah ee carruurtaada.</p>\n<p><strong>Daraasaadka Quraanka</strong>: Hel khayraadka ku saabsan xusuusta Quraanka, waxbarashada Islaamka ee carruurta, horumarka ruuxiga ah, iyo hababka barista qiyamka Islaamka.</p>\n<h3>Xurmada Lagu Qaday</h3>\n<ul>\n<li>Hagaha muhiimka ah ee waalidka cusub</li>\n<li>Talooyinka caafimaadka iyo wanaaga xilliyada</li>\n<li>Dhaqdhaqaaqyada waxbarashada iyo khayraadka barashada</li>\n<li>Caadooyinka dhaqanka iyo Islaamka ee magacyada</li>\n<li>Istiraatiijiyooyinka wanaaga qoyska</li>\n</ul>\n<h3>Raadinta iyo Filter</h3>\n<p>Isticmaal shaqooyinteena raadinta si aad u heshid maqaallo mawduucyo gaar ah, ama ka raadi qaybaha, taariikhda, ama caanka ah. Kaydkeena si joogto ah ayaa loo cusbooneysiinayaa macluumaad cusub si loo siiyo warbixin iyo taageero jahwareerka qoyskaaga.</p>\n<h3>La Socoshada Cusbooneysiinta</h3>\n<p>Qoro newsletterkeena ama nala soco warbaahinta bulshada si aad u heshid ogeysiis marka maqaallo cusub lagu daro kaydkeena.</p>\n<p>Waad ku mahadsan tahay inaad ka mid noqotid bulshada Miftah Som Academy. Waxaan halkan nahay si aan kugu taageerano talaabo kasta oo jahwareerka qoyskaaga ah.</p>\n",
    "language": "so"
  },
  {
    "slug": "contact",
    "title": "Contact Us",
    "html": "<h2>Get in Touch</h2>\n<p>We&#39;d love to hear from you! Whether you have questions, feedback, suggestions, or would like to collaborate with us, we&#39;re here to help.</p>\n<h3>Contact Information</h3>\n<p><strong>Email</strong>: <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a></p>\n<p><strong>Phone</strong>:</p>\n<ul>\n<li>+252907756127</li>\n<li>+252616639802</li>\n</ul>\n<p><strong>Location</strong>: Global Online Platform</p>\n<h3>How We Can Help</h3>\n<ul>\n<li><p><strong>General Inquiries</strong>: Have questions about our content or services? We&#39;re happy to assist.</p>\n</li>\n<li><p><strong>Content Suggestions</strong>: Share ideas for articles, topics, or resources you&#39;d like to see on our platform.</p>\n</li>\n<li><p><strong>Partnership Opportunities</strong>: Interested in collaborating or partnering with us? Let&#39;s connect.</p>\n</li>\n<li><p><strong>Feedback</strong>: Your feedback helps us improve. Share your thoughts and suggestions with us.</p>\n</li>\n<li><p><strong>Technical Support</strong>: Experiencing issues with our website? Reach out and we&#39;ll help resolve them.</p>\n</li>\n</ul>\n<h3>Response Time</h3>\n<p>We aim to respond to all inquiries within 48 hours during business days. For urgent matters, please call us directly.</p>\n<p>Thank you for being part of the Miftah Som Academy community!</p>\n",
    "language": "en"
  },
  {
    "slug": "contact",
    "title": "La Soo Xidhiidh",
    "html": "<h2>Nala Soo Xidhiidh</h2>\n<p>Waxaan jeclaan lahayn inaad nala soo xidhiidhid! Haddii aad su&#39;aalo, aragti, talooyin, ama aad jeclaan lahayd inaad nala shaqaysato, waan halkaagnahay si aan kuugu caawinno.</p>\n<h3>Macluumaadka Xidhiidhka</h3>\n<p><strong>Iimaylka</strong>: <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a></p>\n<p><strong>Telefoonka</strong>:</p>\n<ul>\n<li>+252907756127</li>\n<li>+252616639802</li>\n</ul>\n<p><strong>Goobta</strong>: Platform Online ah ee Caalamiga ah</p>\n<h3>Sida Aan Kugu Caawin Karno</h3>\n<ul>\n<li><p><strong>Weydiiinta Guud</strong>: Ma haysaa su&#39;aalo ku saabsan waxyaabaha ama adeegyada? Waan ku caawinaynaa.</p>\n</li>\n<li><p><strong>Talooyinka Macluumaadka</strong>: Wadaag fikradaha maqaallada, mawduucyada, ama khayraadka aad jeceshahay inaad aragto platformkeena.</p>\n</li>\n<li><p><strong>Fursadaha Iskaashi</strong>: Aad u xiiseysaysid inaad na shaqaysato ama aad nala shaqeyso? Aan isugu xidhiidhno.</p>\n</li>\n<li><p><strong>Aragti</strong>: Aragtidaada ayaa nooga caawineysa inaan hormarno. Wadaag fikraahaga iyo talooyinkaada.</p>\n</li>\n<li><p><strong>Taageerada Tekniko</strong>: La kulantay arrimo websitekeena? Nala soo xidhiidh waana kaa xallin doonaa.</p>\n</li>\n</ul>\n<h3>Waqtiga Jawaabta</h3>\n<p>Waxaan u dadaalaynaa inaan ku jawaabno dhammaan weydiiinta gudaha 48 saacadood ah habeenmada shaqada. Haddii arrimuhu ay degdeg u baahnaanayaan, fadlan nagu wac si toos ah.</p>\n<p>Waad ku mahadsan tahay inaad ka mid noqotid bulshada Miftah Som Academy!</p>\n",
    "language": "so"
  },
  {
    "slug": "cookies",
    "title": "Cookie Policy",
    "html": "<p>We use cookies to improve your experience, remember preferences, and measure how visitors use our site. By continuing to browse, you agree to our cookie use.</p>\n<h3>What are cookies?</h3>\n<p>Small text files stored on your device to help websites function. We use:</p>\n<ul>\n<li><strong>Essential cookies</strong> to keep the site running (cannot be turned off).</li>\n<li><strong>Performance cookies</strong> to understand usage and improve content.</li>\n<li><strong>Preference cookies</strong> to remember language selection and settings.</li>\n</ul>\n<h3>How you can control cookies</h3>\n<ul>\n<li>You can clear or block cookies in your browser settings.</li>\n<li>Turning off non-essential cookies may affect some features.</li>\n<li>To change language without losing your choice, keep preference cookies enabled.</li>\n</ul>\n<h3>Contact</h3>\n<p>Questions? Email us at <a href=\"mailto:support@miftahsom.com\">support@miftahsom.com</a>.</p>\n",
    "language": "en"
  },
  {
    "slug": "cookies",
    "title": "Kukiyada",
    "html": "<p>Waxaan isticmaalnaa kukiyo si aan u hagaajino khibraddaada, u xasuusano doorbidyada, una ogaanno sida martidu u adeegsato bogga. Markaad sii dhex socoto, waxaad oggolaanaysaa isticmaalka kukiyada.</p>\n<h3>Kukiyo maxay yihiin?</h3>\n<p>Waa faylal yar oo qoraal ah oo lagu kaydiyo qalabkaaga si boggagu u shaqeeyaan. Waxaan adeegsanaa:</p>\n<ul>\n<li><strong>Kukiyada muhiimka ah</strong> si goobtu si sax ah u shaqeyso (lagama damin karo).</li>\n<li><strong>Kukiyada waxqabadka</strong> si aan u fahanno isticmaalka oo aan u hagaajino nuxurka.</li>\n<li><strong>Kukiyada doorbidka</strong> si loo xasuusto luqadda aad dooratay iyo dejimahaaga.</li>\n</ul>\n<h3>Sida aad u maamuli karto kukiyada</h3>\n<ul>\n<li>Waxaad ka tirtiri kartaa ama ka xannibi kartaa kukiyada dejimaha biraawsarkaaga.</li>\n<li>Haddii aad damiso kukiyada aan muhiimka ahayn, qaarkood astaamo laga yaabaa inay saameeyaan.</li>\n<li>Si luqadda aad dooratay aanay u lumin, waxa fiican in kukiyada doorbidka la daayo.</li>\n</ul>\n<h3>Nala soo xiriir</h3>\n<p>Su&#39;aalo? Ku soo qor <a href=\"mailto:support@miftahsom.com\">support@miftahsom.com</a>.</p>\n",
    "language": "so"
  },
  {
    "slug": "experts",
    "title": "Expert Contributors",
    "html": "<h2>Expert Contributors</h2>\n<p>At Miftah Som Academy, we are proud to collaborate with a diverse team of expert contributors who bring years of experience, specialized knowledge, and dedication to providing accurate, reliable, and valuable content for families.</p>\n<h3>Our Expert Network</h3>\n<p>Our contributors include professionals from various fields:</p>\n<p><strong>Healthcare Professionals</strong>: Medical doctors, pediatricians, nutritionists, and wellness experts who provide evidence-based health and medical guidance.</p>\n<p><strong>Education Specialists</strong>: Teachers, curriculum developers, child development experts, and educational researchers who share insights on learning and development.</p>\n<p><strong>Parenting Experts</strong>: Family counselors, child psychologists, and experienced parenting coaches who offer practical advice and support.</p>\n<p><strong>Islamic Scholars</strong>: Knowledgeable scholars and educators who provide guidance on Islamic education, values, and spiritual development.</p>\n<p><strong>Cultural Experts</strong>: Professionals who help preserve and share valuable cultural traditions and practices relevant to families.</p>\n<h3>Our Commitment to Expertise</h3>\n<p>All our expert contributors are:</p>\n<ul>\n<li><strong>Qualified Professionals</strong>: Possessing relevant degrees, certifications, or extensive experience in their fields</li>\n<li><strong>Committed to Accuracy</strong>: Dedicated to providing information that is accurate, current, and evidence-based</li>\n<li><strong>Passionate Educators</strong>: Enthusiastic about sharing knowledge and empowering families</li>\n<li><strong>Culturally Aware</strong>: Sensitive to diverse cultural and religious perspectives</li>\n</ul>\n<h3>Contributing Experts</h3>\n<p>We are grateful to each of our expert contributors for their dedication to helping families succeed. Their expertise ensures that Miftah Som Academy remains a trusted source of information and support.</p>\n<h3>Join Our Expert Team</h3>\n<p>Are you a professional with expertise in health, parenting, education, or Islamic studies? We welcome qualified contributors who share our mission of empowering families through knowledge.</p>\n<p>If you&#39;re interested in contributing to Miftah Som Academy, please contact us through our <a href=\"/contact\">Contact Us</a> page with information about your expertise and how you&#39;d like to contribute.</p>\n<p>Thank you for trusting our expert contributors and Miftah Som Academy as your resource for family-focused guidance.</p>\n",
    "language": "en"
  },
  {
    "slug": "experts",
    "title": "Kuwa ka Qayb Qaata",
    "html": "<h2>Kuwa ka Qayb Qaata</h2>\n<p>Miftah Som Academy, waxaan ku faano u nahay inaan la shaqeyno koox ka qayb qaata takhasuus ah oo kala duwan oo u soo gudbiya sanado dheeraad ah oo khibrad, aqoon gaar ah, iyo u go&#39;an ah si loo siiyo macluumaad sax ah, la aamin karo, iyo qiimo leh qoysaska.</p>\n<h3>Shabakadeena Takhasuuska ah</h3>\n<p>Kuwa ka qayb qaata waxaa ka mid ah shaqaale kala duwan goobaha:</p>\n<p><strong>Caafimaadka Caafimaadka</strong>: Dhakhtarro, dhakhtarada carruurta, takhasuusyada cuntada, iyo khubarada wanaaga oo siinaya caawinta caafimaadka iyo talooyinka caafimaadka ku salaysan xogta.</p>\n<p><strong>Takhasuusyada Waxbarashada</strong>: Macallimiin, horumariyeyaasha manhajka, khubarada horumarka carruurta, iyo baadhayaasha waxbarashada oo wadaaga aragtiyada barashada iyo horumarka.</p>\n<p><strong>Khubarada Barbaarinta</strong>: La taliyeyaasha qoyska, saykoolojiistaha carruurta, iyo tababarayaasha barbaarinta leh khibrad oo siinaya talooyin dhaqanle iyo taageero.</p>\n<p><strong>Culimada Islaamka</strong>: Culimo aqoon leh iyo macallimiin oo siinaya hagitaan ku saabsan waxbarashada Islaamka, qiyamka, iyo horumarka ruuxiga ah.</p>\n<p><strong>Khubarada Dhaqanka</strong>: Shaqaale oo ka caawiya ilaalinta iyo wadaagista caadooyin iyo dhaqan muhiim ah ee la xiriira qoysaska.</p>\n<h3>Go&#39;ankeena Takhasuuska ah</h3>\n<p>Dhammaan kuwa ka qayb qaata waxay yihiin:</p>\n<ul>\n<li><strong>Shaqaale Qiyaasta ah</strong>: Leh shahaado, aqoonsiyo, ama khibrad dheeraad ah goobahooda</li>\n<li><strong>U Go&#39;an Saxnaanta</strong>: Dedyay inay siiyaan macluumaadka sax ah, hadda ah, iyo ku salaysan xogta</li>\n<li><strong>Macallimiin Xiiseysan</strong>: Xiiseysan wadaagista aqoonta iyo siinta awood qoysaska</li>\n<li><strong>Wareegsan Dhaqanka</strong>: Dareensan dhigaadaha dhaqanka iyo diinta kala duwan</li>\n</ul>\n<h3>Kuwa ka Qayb Qaata Takhasuuska ah</h3>\n<p>Waxaan u mahad naqaynaa dhammaan kuwa ka qayb qaata takhasuuska ah oo u go&#39;an ka caawinta qoysaska inay guulaystaan. Takhasuuskiisa ayaa hubinayaa in Miftah Som Academy sii noqoto ilaha aad u kalsoonaatid ee macluumaadka iyo taageerada loogu talagalay qoysaska.</p>\n<h3>Ku Biiro Kooxdeena Takhasuuska ah</h3>\n<p>Ma tahay professional leh xirfad ah caafimaadka, barbaarinta, waxbarashada, ama daraasaadka Islaamka? Waxaan soo dhoweynaa kuwa ka qayb qaata qiyaasta ah oo wadaaga ujeeddadeena siinta awood qoysaska iyagoo ku adeegsanaya aqoon.</p>\n<p>Haddii aad xiiseysid inaad ka qayb qaadato Miftah Som Academy, fadlan nala soo xidhiidh bogga <a href=\"/contact\">La Soo Xidhiidh</a> iyadoo la sheegaya xirfadaada iyo sida aad jeclaan lahayd inaad ka qayb qaadato.</p>\n<p>Waad ku mahadsan tahay inaad aaminsantahay kuwa ka qayb qaata takhasuuska ah iyo Miftah Som Academy ilaha aad u kalsoonaatid ee hagitaanka loogu talagalay qoysaska.</p>\n",
    "language": "so"
  },
  {
    "slug": "guidelines",
    "title": "Community Guidelines",
    "html": "<h2>Community Guidelines</h2>\n<p>Welcome to the Miftah Som Academy community! These guidelines help ensure that our platform remains a respectful, supportive, and constructive environment for all members.</p>\n<h3>Our Community Values</h3>\n<p><strong>Respect</strong>: We treat all community members with dignity and respect, regardless of background, beliefs, or perspectives.</p>\n<p><strong>Kindness</strong>: We foster a culture of kindness, empathy, and understanding in all interactions.</p>\n<p><strong>Support</strong>: We aim to be a source of support and encouragement for families on their journey.</p>\n<p><strong>Inclusivity</strong>: We welcome and celebrate diverse perspectives, experiences, and cultural backgrounds.</p>\n<h3>Guidelines for Participation</h3>\n<p><strong>Be Respectful</strong>: Communicate with others in a respectful and courteous manner. Personal attacks, harassment, or discriminatory language will not be tolerated.</p>\n<p><strong>Share Constructively</strong>: When sharing experiences or advice, be constructive and helpful. Remember that every family&#39;s situation is unique.</p>\n<p><strong>Respect Privacy</strong>: Protect your own privacy and respect the privacy of others. Do not share personal information about yourself or others that could be harmful or inappropriate.</p>\n<p><strong>Maintain Accuracy</strong>: When sharing information, strive for accuracy. If you&#39;re unsure about something, it&#39;s okay to say so or direct others to reliable sources.</p>\n<p><strong>Follow Topics</strong>: Keep discussions relevant to the topics at hand and appropriate for our family-focused platform.</p>\n<p><strong>Be Mindful</strong>: Remember that our community includes people from diverse backgrounds and circumstances. Be mindful of cultural, religious, and personal differences.</p>\n<h3>Content Standards</h3>\n<p>We expect all content shared in our community to:</p>\n<ul>\n<li>Be appropriate for a family audience</li>\n<li>Not contain offensive, harmful, or inappropriate material</li>\n<li>Respect intellectual property rights</li>\n<li>Comply with applicable laws and regulations</li>\n</ul>\n<h3>Reporting Concerns</h3>\n<p>If you encounter content or behavior that violates these guidelines, please report it to us. We take all reports seriously and will address them appropriately.</p>\n<h3>Enforcement</h3>\n<p>Violations of these guidelines may result in:</p>\n<ul>\n<li>Content removal</li>\n<li>Warnings</li>\n<li>Temporary or permanent restrictions on platform access</li>\n</ul>\n<p>Our goal is to maintain a positive environment, and we reserve the right to take necessary actions to protect our community.</p>\n<h3>Thank You</h3>\n<p>Thank you for helping us build and maintain a supportive, respectful, and enriching community. Your participation and adherence to these guidelines make Miftah Som Academy a valuable resource for families everywhere.</p>\n<p>If you have questions about these guidelines, please contact us at <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a>.</p>\n",
    "language": "en"
  },
  {
    "slug": "guidelines",
    "title": "Hagaha Bulshada",
    "html": "<h2>Hagaha Bulshada</h2>\n<p>Ku soo dhawoow bulshada Miftah Som Academy! Hagahan waxay ka caawiyaan inaan sii wadno platformkeena inay noqoto meel ixtiraam, taageeraysa, iyo dhisid leh dhammaan xubnaha.</p>\n<h3>Qiyamka Bulshadeena</h3>\n<p><strong>Ixtiraam</strong>: Waxaan u dhaqanaa dhammaan xubnaha bulshada si xurmad iyo ixtiraam leh, iyadoo aan la eegnayn asalka, rumaysadaha, ama aragtiyada.</p>\n<p><strong>Naxariis</strong>: Waxaan dhisaynaa dhaqanka naxariista, dareenka, iyo fahamka dhammaan wadaagalka.</p>\n<p><strong>Taageero</strong>: Waxaan u yeelanaynaa inaan noqonno ilaha taageerada iyo dhiirrigelinta qoysaska jahwareerkooda.</p>\n<p><strong>Isku Darid</strong>: Waxaan soo dhoweynaa oo aan dabaaldegaynaa dhigaadaha kala duwan, khibradaha, iyo asalka dhaqanka.</p>\n<h3>Hagaha Ka Qayb Qaadista</h3>\n<p><strong>U Noq Ixtiraam</strong>: U wada hadal dadka kale si ixtiraam iyo xurmad leh. Weydiinta shakhsi ahaaneed, khatarta, ama luuqada kala duwanaysa ma aqbashay.</p>\n<p><strong>Wadaag Si Dhisid leh</strong>: Markaad wadaagaysid khibradaha ama talooyin, u noq dhisid leh iyo ka caawiya. Xusuusow in xaalad kasta oo qoyska ay u gaar tahay.</p>\n<p><strong>Ixtiraam Sirta</strong>: Ilaali sirtaada iyo ixtiraamka sirta dadka kale. Ha wadaagin macluumaad shakhsi ah oo ku saabsan naftaada ama dadka kale kaasoo noqon kara waxyeelo ama aan habboonayn.</p>\n<p><strong>Ilkaali Saxnaanta</strong>: Markaad wadaagaysid macluumaad, dadaal u yeel saxnaanta. Haddii aadan hubin wax, waa habboon inaad sheegtid ama aad u hogaamiso ilaha aamin ah.</p>\n<p><strong>Raac Mawduucyada</strong>: Si wanaagsan u dhis wareegsi mawduucyada iyo ka habboon platformkeena loogu talagalay qoysaska.</p>\n<p><strong>U Noq Dareensan</strong>: Xusuusow in bulshadeenu ay ka kooban tahay dadka ka soo jeeda asalka iyo xaaladaha kala duwan. U noq dareensan kala duwanaanta dhaqanka, diinta, iyo shakhsi ahaaneed.</p>\n<h3>Heerarka Macluumaadka</h3>\n<p>Waxaan sugaynaa in dhammaan macluumaadka la wadaagayo bulshadeena ay:</p>\n<ul>\n<li>Noqdaan habboon dhagaystaha qoyska</li>\n<li>Aan ka koobanayn waxyeelo, waxyeelo, ama macluumaad aan habboonayn</li>\n<li>Ixtiraam xuquuqaha fikirka</li>\n<li>Raacaan sharciyada iyo xeeladaha la adeegsanayo</li>\n</ul>\n<h3>Warbixinta Walaacaynta</h3>\n<p>Haddii aad la kulantid macluumaad ama dhaqanka ka dhigaya hagahan, fadlan nala soo warbixi. Waxaan si wanaagsan u qaadanaa dhammaan warbixinta waana xallin doonaa si habboon.</p>\n<h3>Fulinta</h3>\n<p>Ka dhigista hagahan waxay keeni kartaa:</p>\n<ul>\n<li>Tirtirka macluumaadka</li>\n<li>Digtoonaadka</li>\n<li>Xayirka waqtiga ama ku meel gaar ah oo ka helitaanka platformka</li>\n</ul>\n<p>Ujeeddu waa inaan si wanaagsan u ilaalino jawiga, waxaan ilaalinaynaa xuquuqda inaan qaadano tallaabooyin loo baahan yahay si loo ilaaliyo bulshadeena.</p>\n<h3>Mahadsanid</h3>\n<p>Waad ku mahadsan tahay ka caawinta inaan dhisno iyo inaan sii wadno bulsho taageeraysa, ixtiraamaysa, iyo hormarinta. Ka qayb qaadiskaaga iyo raacidkaada hagahan waxay ka dhigtay Miftah Som Academy ilaha qiimo leh ee qoysaska meel kasta.</p>\n<p>Haddii aad su&#39;aalo ka qabto hagahan, fadlan nala soo xidhiidh <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a>.</p>\n",
    "language": "so"
  },
  {
    "slug": "privacy",
    "title": "Privacy Policy",
    "html": "<h2>Privacy Policy</h2>\n<p>Last Updated: 2025</p>\n<p>At Miftah Som Academy, we are committed to protecting your privacy and ensuring the security of your personal information. This Privacy Policy explains how we collect, use, and safeguard your information when you visit our website.</p>\n<h3>Information We Collect</h3>\n<p><strong>Personal Information</strong>: We may collect personal information that you voluntarily provide to us, such as your name, email address, and any other information you choose to share when contacting us or subscribing to our services.</p>\n<p><strong>Automatically Collected Information</strong>: When you visit our website, we may automatically collect certain information about your device, including your IP address, browser type, operating system, and browsing patterns.</p>\n<h3>How We Use Your Information</h3>\n<p>We use the information we collect to:</p>\n<ul>\n<li>Provide, maintain, and improve our services</li>\n<li>Respond to your inquiries and requests</li>\n<li>Send you updates about our content and services (with your consent)</li>\n<li>Analyze website usage to improve user experience</li>\n<li>Ensure website security and prevent fraud</li>\n</ul>\n<h3>Information Sharing</h3>\n<p>We do not sell, trade, or rent your personal information to third parties. We may share your information only in the following circumstances:</p>\n<ul>\n<li>With your explicit consent</li>\n<li>To comply with legal obligations</li>\n<li>To protect our rights and safety</li>\n<li>With trusted service providers who assist in operating our website (under strict confidentiality agreements)</li>\n</ul>\n<h3>Data Security</h3>\n<p>We implement appropriate technical and organizational measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction.</p>\n<h3>Your Rights</h3>\n<p>You have the right to:</p>\n<ul>\n<li>Access your personal information</li>\n<li>Request correction of inaccurate information</li>\n<li>Request deletion of your personal information</li>\n<li>Opt-out of marketing communications</li>\n<li>Withdraw consent at any time</li>\n</ul>\n<h3>Cookies and Tracking Technologies</h3>\n<p>We may use cookies and similar tracking technologies to enhance your browsing experience and analyze website traffic. You can control cookie preferences through your browser settings.</p>\n<h3>Changes to This Privacy Policy</h3>\n<p>We may update this Privacy Policy from time to time. We will notify you of any changes by posting the new policy on this page and updating the &quot;Last Updated&quot; date.</p>\n<h3>Contact Us</h3>\n<p>If you have questions about this Privacy Policy or our data practices, please contact us at <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a>.</p>\n",
    "language": "en"
  },
  {
    "slug": "privacy",
    "title": "Siyaasadda Sirta",
    "html": "<h2>Siyaasadda Sirta</h2>\n<p>La Cusbooneysiiyey: 2025</p>\n<p>Miftah Som Academy, waxaan u go&#39;anahay inaan ilaalinno sirtaada iyo hubinta amniga macluumaadkaaga shakhsiga ah. Siyaasaddan sirta waxay u sharaxayso sida aan u ururino, u adeegsano, iyo u ilaalino macluumaadkaaga markaad booqato websitekeena.</p>\n<h3>Macluumaadka aan Ururino</h3>\n<p><strong>Macluumaadka Shakhsiga ah</strong>: Waxaan ururi karnaa macluumaad shakhsi ah oo aad si xorriyadeed noo siisid, sida magacaaga, cinwaankaaga iimaylka, iyo macluumaad kale oo aad door bidhaan markaad nala soo xidhiidhid ama aad qorto adeegyadeena.</p>\n<p><strong>Macluumaadka Si Toos ah loo Ururiyo</strong>: Markaad booqato websitekeena, waxaan si toos ah u ururi karnaa macluumaad gaar ah oo ku saabsan qalabkaaga, oo ay ku jiraan cinwaankaaga IP, nooca browserka, nidaamka shaqaynta, iyo hababka aragista.</p>\n<h3>Sida Aan U Adeegsano Macluumaadkaaga</h3>\n<p>Waxaan u adeegsanaa macluumaadka aan ururino si aan:</p>\n<ul>\n<li>Siino, ilaalinno, iyo hormarino adeegyadeena</li>\n<li>Ku jawaabno weydiiintaada iyo codsigaaga</li>\n<li>Kugu soo dirno cusbooneysiinta macluumaadkeena iyo adeegyadeena (iyadoo la ogolaaday)</li>\n<li>Falanqeeyno isticmaalka website si aan u hormarino khibrada isticmaalaha</li>\n<li>Hubinno amniga websiteka iyo ka hortagga khayaamada</li>\n</ul>\n<h3>Wadaaginta Macluumaadka</h3>\n<p>Ma iibinno, ma kala garaynno, ama ma kiraynno macluumaadkaaga shakhsiga ah qaybaha saddexaad. Waxaan macluumaadkaaga wadaagi karnaa kaliya xaaladaha soo socda:</p>\n<ul>\n<li>Iyadoo la ogolaaday si cad</li>\n<li>Si aan u fulino mas&#39;uuliyadaha sharci ahaanta</li>\n<li>Si aan u ilaalino xuquuqdeena iyo amnigeena</li>\n<li>Adeeg bixiyeyaasha aamin ah oo ka caawiya habaynta websitekeena (iyadoo la xidhaynaayo heerkaada sirta)</li>\n</ul>\n<h3>Amniga Macluumaadka</h3>\n<p>Waxaan hirgelinaa hababka teknikal ah iyo midnimo oo loogu talagalay inaan ilaalino macluumaadkaaga shakhsiga ah ka hor gelinta aan ogolaanayn, beddelka, muujinta, ama burburka.</p>\n<h3>Xuquuqdaada</h3>\n<p>Waxaad leedahay xuquuq inaad:</p>\n<ul>\n<li>Helato macluumaadkaaga shakhsiga ah</li>\n<li>Codsato hagaajinta macluumaadka qaldan</li>\n<li>Codsato tirtirka macluumaadkaaga shakhsiga ah</li>\n<li>Ka baxo macluumaadka suuqgeynta</li>\n<li>Celiiso ogolaanshaha waqti kasta</li>\n</ul>\n<h3>Cookies iyo Teknoolajiyada Raadinta</h3>\n<p>Waxaan isticmaali karnaa cookies iyo teknoolajiyo la mid ah si aan u hormarino khibradaada aragista iyo falanqaynta trafficka websiteka. Waxaad maamuli kartaa doorashooyinka cookiekaaga iyadoo la adeegsanayo dejisyoonkaaga browserka.</p>\n<h3>Isbeddelada Siyaasaddan Sirta</h3>\n<p>Waxaan cusbooneysiin karnaa siyaasaddan sirta waqti kasta. Waxaan kugu ogeysiineynaa isbeddel kasta adoo ku daraya siyaasadda cusub boggan oo cusbooneysiineysa taariikhda &quot;La Cusbooneysiiyey&quot;.</p>\n<h3>La Soo Xidhiidh</h3>\n<p>Haddii aad su&#39;aalo ka qabto siyaasaddan sirta ama dhaqamadeena macluumaadka, fadlan nala soo xidhiidh <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a>.</p>\n",
    "language": "so"
  },
  {
    "slug": "research",
    "title": "Research Library",
    "html": "<h2>Research Library</h2>\n<p>Welcome to the Miftah Som Academy Research Library. This page is managed via Netlify CMS.</p>\n<p>Access our curated collection of research articles and evidence-based resources on topics related to health, parenting, and education.</p>\n",
    "language": "en"
  },
  {
    "slug": "research",
    "title": "Maktabadda Baadhista",
    "html": "<h2>Maktabadda Baadhista</h2>\n<p>Ku soo dhawoow Maktabadda Baadhista Miftah Som Academy, albaabkaaga khayraadka ku salaysan xogta iyo macluumaadka cilmi-baadhista ku saabsan caafimaadka, barbaarinta, waxbarashada, iyo wanaaga qoyska.</p>\n<h3>Ururkaagu</h3>\n<p>Maktabaddadeena baadhista waxay siinaysaa helitaanka kaydka la hagaajiyey ee:</p>\n<p><strong>Daraasaadka La Xaqiijiyey</strong>: Hel koobaan iyo aragtiyada cilmi-baadhista la xaqiijiyey ee la xiriira caafimaadka qoyska, horumarka carruurta, iyo waxbarashada.</p>\n<p><strong>Khayraadka Ku Salaysan Xogta</strong>: Baadi khayraadka ku salaysan cilmi-baadhista iyo caawinta klinik ah, iyadoo la hubiyo inaad heshid macluumaad sax ah oo la aamin karo.</p>\n<p><strong>Materialka Waxbarashada</strong>: Hel hagahada waxbarashada, koobaan baadhista, iyo hababka ugu fiican ee ku salaysan xogta ee taageerida horumarka iyo koritaanka qoyskaaga.</p>\n<p><strong>Falanqeeynta Takhasuuska ah</strong>: Akhri sharxaha takhasuuska ah iyo adeegyada dhaqanle ee natiijooyinka baadhista, adoo sameeyey daraasaadka adag yihiin la gaadhi karo oo dhaqanle qoysaska.</p>\n<h3>Mawduucyada la Qabtay</h3>\n<ul>\n<li>Caafimaadka carruurta iyo horumarka</li>\n<li>Sayniska cuntada iyo wanaaga qoyska</li>\n<li>Sayniska waxbarashada iyo hababka barashada</li>\n<li>Baadhista barbaarinta iyo dhaqanka qoyska</li>\n<li>Daraasaadka carruurta yar iyo horumarka</li>\n<li>Baadhista dhaqanka iyo bulshada ee la xiriira qoysaska</li>\n</ul>\n<h3>Sida Loo Isticmaalo Maktabaddan</h3>\n<ul>\n<li><strong>Ka Raadi Mawduuc</strong>: U dhaadhac kaydka la hagaajiyey iyadoo adeegsanaysa qaybaha mawduucyada</li>\n<li><strong>Raadi</strong>: Isticmaal ereyada muhiimka ah si aad u heshid mawduucyo ama daraasaad gaar ah</li>\n<li><strong>La Soco</strong>: Hel macluumaadka baadhista ugu dambeeya iyo talooyinka ku salaysan xogta</li>\n<li><strong>Baro</strong>: Faham sida natiijooyinka baadhista loo adeegsan karo nolosha maalinle ee qoyskaaga</li>\n</ul>\n<h3>Go&#39;anka Macluumaadka Ku Salaysan Xogta</h3>\n<p>Miftah Som Academy, waxaan u go&#39;anahay inaan siino macluumaadka ku salaysan baadhista aamin ah iyo xogta. Maktabaddadeena baadhista waxay muujinaysaa go&#39;ankaan, adiga oo siinaysa helitaanka ilaha aamin ah iyo macluumaadka cilmi-baadhista.</p>\n<p>Waxaan si joogto ah u cusbooneysiinaynaa maktabaddadeena baadhista iyadoo la darsanayo baadhista cusub iyo khayraad si loo hubiyo inaad helato macluumaadka ugu dambeeya ee la heli karo.</p>\n",
    "language": "so"
  },
  {
    "slug": "rss",
    "title": "RSS Feeds",
    "html": "<h2>RSS Feeds</h2>\n<p>Stay updated with the latest articles and content from Miftah Som Academy by subscribing to our RSS feeds.</p>\n<h3>What is RSS?</h3>\n<p>RSS (Really Simple Syndication) allows you to receive automatic updates from our website directly to your RSS reader or feed aggregator. When we publish new content, you&#39;ll be notified immediately.</p>\n<h3>Available RSS Feeds</h3>\n<p>Subscribe to our main RSS feed to receive updates on all new articles and content across all categories:</p>\n<p><strong>Main Feed</strong>: <code>/feed.xml</code> - All articles and updates</p>\n<p><strong>Category-Specific Feeds</strong>:</p>\n<ul>\n<li>Health &amp; Nutrition: <code>/feed/health.xml</code></li>\n<li>Parenting: <code>/feed/parenting.xml</code></li>\n<li>Education: <code>/feed/education.xml</code></li>\n<li>Baby Names: <code>/feed/baby-names.xml</code></li>\n<li>Quran Studies: <code>/feed/quran.xml</code></li>\n</ul>\n<h3>How to Subscribe</h3>\n<ol>\n<li><p><strong>Choose an RSS Reader</strong>: Select an RSS reader application or online service. Popular options include:</p>\n<ul>\n<li>Feedly</li>\n<li>Inoreader</li>\n<li>NewsBlur</li>\n<li>Built-in browser RSS readers</li>\n</ul>\n</li>\n<li><p><strong>Add Our Feed</strong>: Copy the RSS feed URL and add it to your RSS reader. You can subscribe to our main feed or specific category feeds based on your interests.</p>\n</li>\n<li><p><strong>Stay Updated</strong>: Your RSS reader will automatically check for new content and notify you when new articles are published.</p>\n</li>\n</ol>\n<h3>Benefits of RSS</h3>\n<ul>\n<li><strong>Stay Informed</strong>: Never miss new content from Miftah Som Academy</li>\n<li><strong>Save Time</strong>: Access all updates in one convenient location</li>\n<li><strong>Privacy Friendly</strong>: No need to share your email address</li>\n<li><strong>Efficient</strong>: Get notified immediately when new content is published</li>\n</ul>\n<h3>Feed Information</h3>\n<p>Our RSS feeds include:</p>\n<ul>\n<li>Article titles and excerpts</li>\n<li>Publication dates</li>\n<li>Category information</li>\n<li>Links to full articles</li>\n</ul>\n<h3>Technical Details</h3>\n<p>Our RSS feeds are updated in real-time as new content is published. The feeds are formatted according to RSS 2.0 standards and are compatible with all standard RSS readers.</p>\n<p>Thank you for following Miftah Som Academy through RSS feeds. We&#39;re committed to keeping you informed with valuable family-focused content.</p>\n",
    "language": "en"
  },
  {
    "slug": "rss",
    "title": "RSS Feeds",
    "html": "<h2>RSS Feeds</h2>\n<p>La soco macluumaadka ugu dambeeya ee maqaallada iyo macluumaadka Miftah Som Academy iyadoo la qoraysa RSS feedskeena.</p>\n<h3>Waa Maxay RSS?</h3>\n<p>RSS (Really Simple Syndication) wuxuu kuu oggolaanayaa inaad helato cusbooneysiinta si toos ah ee websitekeena toos ah RSS aqriyeheeda ama feed aggregatorkeeda. Markaan daabacno macluumaad cusub, si dhaqsaha ah ayaa loo ogeysiineynaa.</p>\n<h3>RSS Feeds la Heli karo</h3>\n<p>Qor RSS feedka ugu weyn si aad u heshid cusbooneysiinta maqaallada cusub iyo macluumaadka dhammaan qaybaha:</p>\n<p><strong>Feed ugu Weyn</strong>: <code>/feed.xml</code> - Dhammaan maqaallada iyo cusbooneysiinta</p>\n<p><strong>Feeds-ka Qaybaha Gaarka ah</strong>:</p>\n<ul>\n<li>Caafimaadka iyo Nafkaafa: <code>/feed/health.xml</code></li>\n<li>Barbaarinta: <code>/feed/parenting.xml</code></li>\n<li>Waxbarashada: <code>/feed/education.xml</code></li>\n<li>Magacyada Carruurta: <code>/feed/baby-names.xml</code></li>\n<li>Daraasaadka Quraanka: <code>/feed/quran.xml</code></li>\n</ul>\n<h3>Sida Loo Qoro</h3>\n<ol>\n<li><p><strong>Dooro RSS Aqriyehe</strong>: Dooro codsiye RSS aqriyehe ama adeeg online ah. Doorashooyinka caanka ah waxaa ka mid ah:</p>\n<ul>\n<li>Feedly</li>\n<li>Inoreader</li>\n<li>NewsBlur</li>\n<li>RSS aqriyeyaasha ku jira browserka</li>\n</ul>\n</li>\n<li><p><strong>Ku Dar Feedkeena</strong>: Nuqul RSS feed URL-ka oo ku dar RSS aqriyeheediisa. Waxaad qori kartaa feedkeena ugu weyn ama feeds-ka qaybaha gaarka ah iyadoo ku xiraneysa xiiseyntaada.</p>\n</li>\n<li><p><strong>La Soco Cusbooneysiinta</strong>: RSS aqriyeheediisa ayaa si toos ah u baadhinayna cusbooneysiinta cusub oo kugu ogeysiineysa marka macluumaad cusub la daabaco.</p>\n</li>\n</ol>\n<h3>Faa&#39;iidooyinka RSS</h3>\n<ul>\n<li><strong>La Soco Wargelin</strong>: Ma daahirin macluumaad cusub oo ka socda Miftah Som Academy</li>\n<li><strong>Kaydso Waqtiga</strong>: Hel dhammaan cusbooneysiinta meel hal ah oo raaxo leh</li>\n<li><strong>Naxariista Sirta</strong>: Aan loo baahanayn inaad wadaagid cinwaankaaga iimaylka</li>\n<li><strong>Waxtar leh</strong>: Hel ogeysiis si dhaqsaha ah marka macluumaad cusub la daabaco</li>\n</ul>\n<h3>Macluumaadka Feed</h3>\n<p>RSS feedskeena waxay ka kooban yihiin:</p>\n<ul>\n<li>Cinwaannada maqaallada iyo koobaan</li>\n<li>Taariikhaha daabacada</li>\n<li>Macluumaadka qaybaha</li>\n<li>Xidhiidyaha maqaallada buuxa</li>\n</ul>\n<h3>Macluumaadka Teknikal ah</h3>\n<p>RSS feedskeena si joogto ah ayaa loo cusbooneysiinayaa marka macluumaad cusub la daabaco. Feeds-ka waa qaabaysan iyadoo la raacayo RSS 2.0 standards waxayna u haboon yihiin dhammaan RSS aqriyeyaasha caadiga ah.</p>\n<p>Waad ku mahadsan tahay inaad raacayso Miftah Som Academy RSS feeds-ka. Waxaan u go&#39;anahay inaan kugu siino macluumaad qiimo leh oo loogu talagalay qoysaska.</p>\n",
    "language": "so"
  },
  {
    "slug": "team",
    "title": "Editorial Team",
    "html": "<h2>Our Editorial Team</h2>\n<p>Our editorial team is comprised of dedicated professionals with extensive expertise in their respective fields. Together, we ensure that all content published on Miftah Som Academy meets our high standards for accuracy, relevance, and professionalism.</p>\n<h3>Our Commitment</h3>\n<p>Our team is committed to:</p>\n<ul>\n<li><p><strong>Accuracy</strong>: Ensuring all information is fact-checked and based on reliable sources and current research.</p>\n</li>\n<li><p><strong>Relevance</strong>: Creating content that addresses real needs and concerns of families today.</p>\n</li>\n<li><p><strong>Cultural Sensitivity</strong>: Respecting and honoring diverse cultural and religious perspectives while providing inclusive, respectful content.</p>\n</li>\n<li><p><strong>Continuous Learning</strong>: Staying updated with the latest research, trends, and best practices in health, parenting, education, and Islamic studies.</p>\n</li>\n<li><p><strong>Quality Assurance</strong>: Reviewing and refining every piece of content before publication to ensure it meets our editorial standards.</p>\n</li>\n</ul>\n<h3>Our Expertise</h3>\n<p>Our editorial team includes specialists in:</p>\n<ul>\n<li>Child health and development</li>\n<li>Parenting and family dynamics</li>\n<li>Early childhood and general education</li>\n<li>Islamic studies and values</li>\n<li>Cultural traditions and practices</li>\n<li>Research methodology and evidence-based practice</li>\n</ul>\n<h3>Contributing to Excellence</h3>\n<p>If you&#39;re a professional with expertise in our focus areas and are interested in contributing to Miftah Som Academy, please contact us through our <a href=\"/contact\">Contact Us</a> page. We&#39;re always looking for qualified contributors who share our commitment to empowering families through knowledge.</p>\n<p>Thank you for trusting Miftah Som Academy as your source for reliable family-focused content.</p>\n",
    "language": "en"
  },
  {
    "slug": "team",
    "title": "Kooxda Wax qorista",
    "html": "<h2>Kooxdeena Wax qorista</h2>\n<p>Kooxdeena wax qorista waxay ka kooban tahay shaqaale xirfad leh oo leh khibrad dheeraad ah goobahooda. Waxaan wada ka ilaalinaynaa in dhammaan macluumaadka laga daabacayo Miftah Som Academy ay buuxiyaan heerarkeena sare ee sax ah, muhiimad, iyo professional ahaansha.</p>\n<h3>Go&#39;ankeenna</h3>\n<p>Kooxdeena waxay u go&#39;an tahay:</p>\n<ul>\n<li><p><strong>Saxnaanta</strong>: Hubinta in dhammaan macluumaadka la xaqiijiyo oo ku salaysan ilaha aamin ah iyo cilmi-baadhista hadda.</p>\n</li>\n<li><p><strong>Muhiimadda</strong>: Abuurista macluumaad oo ka hadlaya baahiyaha iyo walaacaynta qoysaska maanta.</p>\n</li>\n<li><p><strong>Dareenka Dhaqanka</strong>: Ixtiraam iyo sharaf dhigaadaha dhaqanka iyo diinta kala duwan iyadoo la bixinaayo macluumaad ka kooban, ixtiraam leh.</p>\n</li>\n<li><p><strong>Barashada Joogtada ah</strong>: La socoshada cilmi-baadhista, xirfadaha, iyo hababka ugu fiican ee caafimaadka, barbaarinta, waxbarashada, iyo daraasaadka Islaamka.</p>\n</li>\n<li><p><strong>Hubinta Tayada</strong>: Dib u eegis iyo hagaajin dhammaan qaybta macluumaadka kahor daabacidda si loo hubiyo inay buuxiyaan heerarkeena wax qorista.</p>\n</li>\n</ul>\n<h3>Xirfadeena</h3>\n<p>Kooxdeena wax qorista waxay ka kooban tahay takhasuusiyiin:</p>\n<ul>\n<li>Caafimaadka carruurta iyo horumarka</li>\n<li>Dhaqanka barbaarinta iyo qoysaska</li>\n<li>Waxbarashada carruurta yar iyo guud</li>\n<li>Daraasaadka Islaamka iyo qiyamka</li>\n<li>Caadooyinka dhaqanka iyo dhaqanka</li>\n<li>Qaabka baadhista iyo dhaqanka ku salaysan xogta</li>\n</ul>\n<h3>Ka Qayb Qaadista Hufnaanta</h3>\n<p>Haddii aad tahay professional leh xirfad ah goobahayaga aad ku xiiseysid iyo aad jeceshahay inaad ka qayb qaadato Miftah Som Academy, fadlan nala soo xidhiidh bogga <a href=\"/contact\">La Soo Xidhiidh</a>. Waxaan jeclaan lahayn inaan raadino kuwo ka qayb qaata oo qiyaasta ah oo wadaaga go&#39;ankeena siinta awood qoysaska iyagoo ku adeegsanaya aqoon.</p>\n<p>Waad ku mahadsan tahay inaad aaminsantahay takhasuusiyiinta ka qayb qaata iyo Miftah Som Academy ilaha aad u kalsoonaatid ee macluumaadka loogu talagalay qoysaska.</p>\n",
    "language": "so"
  },
  {
    "slug": "terms",
    "title": "Terms of Service",
    "html": "<h2>Terms of Service</h2>\n<p>Last Updated: 2025</p>\n<p>These Terms of Service govern your use of the Miftah Som Academy website and services. By accessing and using our website, you agree to comply with and be bound by these terms.</p>\n<h3>Acceptance of Terms</h3>\n<p>By accessing, browsing, or using this website, you acknowledge that you have read, understood, and agree to be bound by these Terms of Service and our Privacy Policy.</p>\n<h3>Use of Content</h3>\n<p><strong>Educational Purpose</strong>: All content on Miftah Som Academy is provided for educational and informational purposes only. It is not intended as a substitute for professional medical, legal, or financial advice.</p>\n<p><strong>Intellectual Property</strong>: All content, including articles, images, graphics, logos, and other materials on this website, is the property of Miftah Som Academy or its content providers and is protected by copyright and other intellectual property laws.</p>\n<p><strong>Limited License</strong>: You may view, download, and print content from this website for personal, non-commercial use only. You may not reproduce, distribute, modify, or create derivative works without prior written permission.</p>\n<h3>User Conduct</h3>\n<p>You agree to use this website in a manner that is:</p>\n<ul>\n<li>Lawful and in compliance with all applicable laws and regulations</li>\n<li>Respectful of others&#39; rights and dignity</li>\n<li>Not harmful, threatening, or abusive</li>\n<li>Not in violation of any third-party rights</li>\n</ul>\n<h3>Disclaimer of Warranties</h3>\n<p>This website and its content are provided &quot;as is&quot; without warranties of any kind, either express or implied. We do not guarantee that:</p>\n<ul>\n<li>The website will be available at all times or error-free</li>\n<li>The content is accurate, complete, or current</li>\n<li>The website will meet your specific requirements</li>\n</ul>\n<h3>Limitation of Liability</h3>\n<p>Miftah Som Academy shall not be liable for any indirect, incidental, special, consequential, or punitive damages resulting from your use of or inability to use this website.</p>\n<h3>Medical and Professional Disclaimer</h3>\n<p>The health, parenting, and educational information provided on this website is for general informational purposes only and should not be considered medical, legal, or professional advice. Always consult qualified professionals for specific advice tailored to your situation.</p>\n<h3>External Links</h3>\n<p>Our website may contain links to external websites. We are not responsible for the content, privacy policies, or practices of external websites.</p>\n<h3>Changes to Terms</h3>\n<p>We reserve the right to modify these Terms of Service at any time. Changes will be effective immediately upon posting. Your continued use of the website constitutes acceptance of the modified terms.</p>\n<h3>Governing Law</h3>\n<p>These Terms of Service are governed by and construed in accordance with applicable laws, without regard to conflict of law principles.</p>\n<h3>Contact Information</h3>\n<p>If you have questions about these Terms of Service, please contact us at <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a>.</p>\n",
    "language": "en"
  },
  {
    "slug": "terms",
    "title": "Shuruudaha Adeegga",
    "html": "<h2>Shuruudaha Adeegga</h2>\n<p>La Cusbooneysiiyey: 2025</p>\n<p>Shuruudahan Adeegga waxay maamulaan isticmaalkaaga websiteka iyo adeegyada Miftah Som Academy. Adiga oo booqanaya iyo adeegsanaya websitekeena, waad ogolaataa inaad raacdo oo aad ku xidhantahay shuruudahan Adeegga iyo Siyaasadeena Sirta.</p>\n<h3>Aqbalida Shuruudaha</h3>\n<p>Adiga oo booqanaya, ka raadineysa, ama adeegsanaya websitekan, waad aqbashay inaad akhriday, fahamtay, oo aad ku heshay inaad raacdo shuruudahan Adeegga iyo Siyaasadeena Sirta.</p>\n<h3>Isticmaalka Macluumaadka</h3>\n<p><strong>Ujeedada Waxbarashada</strong>: Dhammaan macluumaadka ee Miftah Som Academy waxaa loo siiyay ujeedooyin waxbarasho iyo macluumaad oo kaliya. Lama u dhigmo inay noqoto beddelka caawinta caafimaad, sharci, ama dhaqaale.</p>\n<p><strong>Xuquuqda Fikirka</strong>: Dhammaan macluumaadka, oo ay ku jiraan maqaallada, sawirada, graphics, logos, iyo material kale ee websitekan, waa hantida Miftah Som Academy ama kuwa soo saaraya macluumaadka waxayna ilaalishaa xuquuqda daabacada iyo xuquuqaha kale ee fikirka.</p>\n<p><strong>Rukhsada Kooban</strong>: Waxaad aragti ka heli kartaa, soo degi kartaa, iyo daabaci kartaa macluumaadka websitekan ujeedooyin shakhsi ah, ganacsi aan ahayn oo kaliya. Ma awoodid inaad sameyso, aad kala bixisid, aad hagaajisid, ama aad abuurisid shuqula loo beddelay iyadoo aan rukhsad hore loo siinin qoraal ah.</p>\n<h3>Dhaqanka Isticmaalaha</h3>\n<p>Waxaad ogolaataa inaad websitekan u adeegsato habka:</p>\n<ul>\n<li>Sharci ah oo raaca dhammaan sharciyada iyo xeeladaha la adeegsanayo</li>\n<li>Ixtiraam leh xuquuqaha iyo sharafka dadka kale</li>\n<li>Aan ahayn waxyeelo, khatar, ama xadgudub</li>\n<li>Aan ahayn wax ka dhaca xuquuqaha qaybaha saddexaad</li>\n</ul>\n<h3>Dhammaadka Damaanada</h3>\n<p>Websitekan iyo macluumaadkiisa waxaa loo siiyay &quot;sida uu u yahay&quot; iyadoo aan damaanado ahayn mid kasta oo cod ah ama ku dheeri kara. Ma hubinno in:</p>\n<ul>\n<li>Websiteku ay waqti kasta hel karto ama aanay qalad ka jirin</li>\n<li>Macluumaadku uu sax yahay, dhamaystiran, ama hadda ah</li>\n<li>Websiteku ay buuxinayso baahiyahaaga gaarka ah</li>\n</ul>\n<h3>Xadidka Mas&#39;uuliyadda</h3>\n<p>Miftah Som Academy ma noqon doonto mas&#39;uul ka mid ah, aan toos ahayn, gaarka ah, gaarka ah, saamaynta, ama ciqaabta ka dhalata isticmaalkaaga ama awooddaada inaad websitekan u adeegsato.</p>\n<h3>Dhammaadka Caafimaadka iyo Professional ah</h3>\n<p>Macluumaadka caafimaadka, barbaarinta, iyo waxbarashada ee websitekan waa macluumaad guud oo kaliya oo loogu talagalay ujeedooyin macluumaad oo kaliya oo aan loo malayn karo caawinta caafimaad, sharci, ama professional ah. Had iyo jeer la iska qabsado khubaro qiyaasta ah si loo helo caawinta gaarka ah ee loogu talagalay xaaladaada.</p>\n<h3>Xidhiidyaha Dibedda</h3>\n<p>Websitekeena waxaa ku jiri kara xidhiidyaha websiteyada dibedda ah. Ma mas&#39;uul karno macluumaadka, siyaasadaha sirta, ama dhaqamada websiteyada dibedda ah.</p>\n<h3>Isbeddelada Shuruudaha</h3>\n<p>Waxaan ilaalinaynaa xuquuqda inaan hagaajino shuruudahan Adeegga waqti kasta. Isbeddelada ayaa dhaqan geli doona si dhaqsaha ah marka la soo daabaco. Isticmaalkaaga sii wadista websiteka ayaa ahayd aqbalida shuruudaha la hagaajiyey.</p>\n<h3>Sharci ahaanta Sharciga</h3>\n<p>Shuruudahan Adeegga waxaa maamulaya oo lagu qeexay iyadoo la raacayo sharciyada la adeegsanayo, iyadoo aan la eegnayn mabaadi&#39;da sharciyada khilaafka.</p>\n<h3>Macluumaadka Xidhiidhka</h3>\n<p>Haddii aad su&#39;aalo ka qabto shuruudahan Adeegga, fadlan nala soo xidhiidh <a href=\"mailto:miftahsom@gmail.com\">miftahsom@gmail.com</a>.</p>\n",
    "language": "so"
  }
]